# 12) დააკვირდით მოცემულ flowchart-ს, ახსენით მისი მუშაობის პრინციპი. მისი მიხედვით შეადგინეთ პროგრამა და დაწერეთ რა შედეგს გამოიტანს კოდი იმ შემთხვევაში როცა მომხმარებელი არის 14 წლის და არ არის სტუდენტი.

# ამ flowchart-ის მიხედვით თუ ხარ 18 წელზე პატარა და ხარ სტუდენტი გეკუთვნის 20% ფასდაკლება.
# ან თუ ხარ 18 წელზე პატარა მაგრამ არ ხარ სტუდენტი შენ გეკუთვნის 10% ფასდაკლება
# მაგრამ თუ ხარ 18 წელს ზემოთ შენ არანაირი ფასდაკლება.

# ანუ თუ მომხმარებელი არის 14-ის მაგრამ არ არის სტუდენტი მას ეკუთვნის 10% ფასდაკლება.